app/Views/auth/login.php

    <div class="card-auth text-center">
        <?php
        $db = \Config\Database::connect();
        $company = $db->table('tb_company_profile')->get()->getRowArray();
---
SELECT *
FROM `tb_company_profile`