app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();

        $total_users = $db->table('tb_users')->countAllResults();

        $tables = [
            'da_audit_bond', 'da_compliance_bond', 'da_risk_bond', 'da_formulir_insiden',
            'igrc_audit_bond', 'igrc_compliance_bond', 'igrc_risk_bond', 'igrc_fraud_bond',
            'igrc_incident_bond', 'igrc_cyber_bond', 'igrc_third_party_bond',
            'igrc_continuity_bond', 'igrc_control_bond'
        ];

        $total_laporan = 0;
        $menunggu_approval = 0;

        foreach ($tables as $table) {
            $total_laporan += $db->table($table)->countAllResults();
            $menunggu_approval += $db->table($table)
                                     ->whereNotIn('status', ['approve_pt', 'ditolak'])
                                     ->countAllResults();
        }

        $risiko_tinggi = 0;
        $risiko_tinggi += $db->table('da_risk_bond')->where('tingkat_risiko', 'Tinggi')->countAllResults();
        $risiko_tinggi += $db->table('igrc_risk_bond')->where('tingkat', 'Tinggi')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_users`
SELECT COUNT(*) AS `numrows`
FROM `igrc_risk_bond`
WHERE `tingkat` = 'Tinggi'
SELECT COUNT(*) AS `numrows`
FROM `da_risk_bond`
WHERE `tingkat_risiko` = 'Tinggi'