app/Controllers/Admin/Hierarchy.php

SELECT *
FROM `users`
WHERE `level` = 'PIMPINAN TINGGI'
SELECT *
FROM `users`
WHERE `level` = 'MANAGERIAL'
SELECT *
FROM `users`
WHERE `level` = 'SUPERVISOR'
SELECT *
FROM `users`
WHERE `level` = 'KEPALA UNIT'
SELECT *
FROM `users`
WHERE `level` = 'STAFF'
SELECT *
FROM `hierarchy`
---
    public function index()
    {
        $userModel = new UserModel();
        $hierarchyModel = new HierarchyModel();

        $data = [
            'title' => 'Setting Hierarchy',
            'pimpinan_tinggi' => $userModel->where('level', 'PIMPINAN TINGGI')->findAll(),
            'managerial'      => $userModel->where('level', 'MANAGERIAL')->findAll(),
            'supervisor'      => $userModel->where('level', 'SUPERVISOR')->findAll(),
            'kepala_unit'     => $userModel->where('level', 'KEPALA UNIT')->findAll(),
            'staff'           => $userModel->where('level', 'STAFF')->findAll(),
            'hierarchy'       => $hierarchyModel->findAll()