app/Controllers/Admin/MasterData.php

SELECT *
FROM `master_data`
---
    public function index()
    {
        $data = [
            'title' => 'Master Data Area',
            'areas' => $this->masterDataModel->findAll()