app/Controllers/Admin/Notifikasi.php

    public function index()
    {
        $data = [
            'title' => 'Kirim Notifikasi',
            'users' => $this->userModel->findAll()
---
SELECT *
FROM `tb_users`