app/Controllers/Admin/PantauLaporan.php

    public function index()
    {
        $data = [
            'title' => 'Pantau Laporan Staff',
            'pimpinanTinggi' => $this->userModel->where('level', 'PIMPINAN TINGGI')->findAll()
        ];
---
SELECT *
FROM `users`
WHERE `level` = 'STAFF'
SELECT *
FROM `tb_users`
WHERE `level` = 'PIMPINAN TINGGI'

    public function get_hierarchy_down()
    {
        $atasanId = $this->request->getPost('atasan_id');
        $bawahan = $this->hierarchyModel
            ->select('tb_users.id, tb_users.nama_lengkap, tb_users.level')
            ->join('tb_users', 'tb_users.id = tb_user_hierarchy.bawahan_id')
            ->where('tb_user_hierarchy.atasan_id', $atasanId)
            ->findAll();
---
SELECT `tb_users`.`id`, `tb_users`.`nama_lengkap`, `tb_users`.`level`
FROM `tb_user_hierarchy`
JOIN `tb_users` ON `tb_users`.`id` = `tb_user_hierarchy`.`bawahan_id`
WHERE `tb_user_hierarchy`.`atasan_id` = '4'