app/Controllers/Admin/UserHierarchy.php

SELECT *
FROM `tb_users`
WHERE `level` = 'KEPALA UNIT'
---
    public function get_bawahan()
    {
        $atasanLevel = $this->request->getPost('atasan_level');
        $atasanId = $this->request->getPost('atasan_id');

        $bawahanLevel = '';
        switch ($atasanLevel) {
            case 'PIMPINAN TINGGI': $bawahanLevel = 'MANAGERIAL'; break;
            case 'MANAGERIAL': $bawahanLevel = 'SUPERVISOR'; break;
            case 'SUPERVISOR': $bawahanLevel = 'KEPALA UNIT'; break;
            case 'KEPALA UNIT': $bawahanLevel = 'STAFF'; break;
        }

        $assignedBawahanIds = array_column($this->hierarchyModel->findAll(), 'bawahan_id');
        $currentAtasanBawahanIds = array_column($this->hierarchyModel->where('atasan_id', $atasanId)->findAll(), 'bawahan_id');

        $allBawahan = $this->userModel->where('level', $bawahanLevel)->findAll();