app/Controllers/KepalaUnit/PantauProgres.php

SELECT *
FROM `da_audit_bond`
WHERE `user_id` = '3'
SELECT *
FROM `da_compliance_bond`
WHERE `user_id` = '3'
SELECT *
FROM `da_risk_bond`
WHERE `user_id` = '3'
SELECT *
FROM `igrc_audit_bond`
WHERE `user_id` = '3'
SELECT *
FROM `igrc_compliance_bond`
WHERE `user_id` = '3'
SELECT *
FROM `igrc_risk_bond`
WHERE `user_id` = '3'
SELECT *
FROM `igrc_fraud_bond`
WHERE `user_id` = '3'
SELECT *
FROM `igrc_incident_bond`
WHERE `user_id` = '3'
SELECT *
FROM `igrc_cyber_bond`
WHERE `user_id` = '3'
SELECT *
FROM `igrc_third_party_bond`
WHERE `user_id` = '3'
SELECT *
FROM `igrc_continuity_bond`
WHERE `user_id` = '3'
SELECT *
FROM `igrc_control_bond`
WHERE `user_id` = '3'
---
    public function index()
    {
        $userId = session()->get('id');
        $data = [
            'title' => 'Pantau Progres Laporan Saya',
            'da_audit'      => (new \App\Models\FormsAudit\AuditBondModel())->where('user_id', $userId)->findAll(),
            'da_compliance' => (new \App\Models\FormsAudit\ComplianceBondModel())->where('user_id', $userId)->findAll(),
            'da_risk'       => (new \App\Models\FormsAudit\RiskBondModel())->where('user_id', $userId)->findAll(),
            'da_insiden'    => (new \App\Models\FormsAudit\InsidenModel())->where('user_id', $userId)->findAll(),
            'igrc_audit'       => (new \App\Models\FormsInternalGRC\IntAuditBondModel())->where('user_id', $userId)->findAll(),
            'igrc_compliance'  => (new \App\Models\FormsInternalGRC\IntComplianceBondModel())->where('user_id', $userId)->findAll(),
            'igrc_risk'        => (new \App\Models\FormsInternalGRC\IntRiskBondModel())->where('user_id', $userId)->findAll(),
            'igrc_fraud'       => (new \App\Models\FormsInternalGRC\IntFraudBondModel())->where('user_id', $userId)->findAll(),
            'igrc_incident'    => (new \App\Models\FormsInternalGRC\IntIncidentBondModel())->where('user_id', $userId)->findAll(),
            'igrc_cyber'       => (new \App\Models\FormsInternalGRC\IntCyberBondModel())->where('user_id', $userId)->findAll(),
            'igrc_third_party' => (new \App\Models\FormsInternalGRC\IntThirdPartyBondModel())->where('user_id', $userId)->findAll(),
            'igrc_continuity'  => (new \App\Models\FormsInternalGRC\IntContinuityBondModel())->where('user_id', $userId)->findAll(),
            'igrc_control'     => (new \App\Models\FormsInternalGRC\IntControlBondModel())->where('user_id', $userId)->findAll(),