app/Controllers/Staff/InputAuditInternal/AuditBond.php

SELECT *
FROM `tb_master_lokasi`
---
    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_master_lokasi');
        $lokasi = $builder->get()->getResultArray();