app/Helpers/notif_helper.php

    function kirim_notif_ke_atasan($judul, $pesan) {
        $db = \Config\Database::connect();
        $userId = session()->get('id');

        // Cari siapa atasan dari user yang sedang login saat ini
        $hierarchy = $db->table('tb_user_hierarchy')->where('bawahan_id', $userId)->get()->getRowArray();

        if ($hierarchy) {
            $db->table('tb_notifikasi')->insert([
                'user_id'    => $hierarchy['atasan_id'],
                'judul'      => $judul,
                'pesan'      => $pesan,
                'is_read'    => 0,
                'created_at' => date('Y-m-d H:i:s')
            ]);
---
SELECT *
FROM `tb_user_hierarchy`
WHERE `bawahan_id` = '2'
INSERT INTO `tb_notifikasi` (`user_id`, `judul`, `pesan`, `is_read`, `created_at`) VALUES ('3', 'Laporan Baru Masuk', 'Staff telah mengirimkan formulir laporan Audit Bond baru yang menunggu verifikasi Anda.', 0, '2026-03-03 11:16:10')