app/Controllers/AuthController.php

    public function process()
    {
        $session = session();
        $model = new UserModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $data = $model->where('username', $username)->first();
---
SELECT *
FROM `tb_users`
WHERE `username` = 'admin'
 LIMIT 1