app/Controllers/NotifikasiAction.php

    public function read($id)
    {
        $db = \Config\Database::connect();
        $db->table('tb_notifikasi')->where('id', $id)->update(['is_read' => 1]);
---
UPDATE `tb_notifikasi` SET `is_read` = 1
WHERE `id` = '14'