app/Controllers/Staff/PantauProgres.php

SELECT *
FROM `da_audit_bond`
WHERE `user_id` = '2'
SELECT *
FROM `da_compliance_bond`
WHERE `user_id` = '2'
SELECT *
FROM `da_risk_bond`
WHERE `user_id` = '2'
---
    public function index()
    {
        $userId = session()->get('id');
        $data = [
            'title' => 'Pantau Progres Laporan',
            'da_audit'      => (new \App\Models\FormsAudit\AuditBondModel())->where('user_id', $userId)->findAll(),
            'da_compliance' => (new \App\Models\FormsAudit\ComplianceBondModel())->where('user_id', $userId)->findAll(),
            'da_risk'       => (new \App\Models\FormsAudit\RiskBondModel())->where('user_id', $userId)->findAll(),
            'da_insiden'    => (new \App\Models\FormsAudit\InsidenModel())->where('user_id', $userId)->findAll(),
            'igrc_audit'       => (new \App\Models\FormsInternalGRC\IntAuditBondModel())->where('user_id', $userId)->findAll(),
            'igrc_compliance'  => (new \App\Models\FormsInternalGRC\IntComplianceBondModel())->where('user_id', $userId)->findAll(),
            'igrc_risk'        => (new \App\Models\FormsInternalGRC\IntRiskBondModel())->where('user_id', $userId)->findAll(),