app/Views/layouts/header.php

                            <i class='bi bi-bell bi-sub fs-4'></i>
                            <?php
                                $db = \Config\Database::connect();
                                $notifikasi = $db->table('tb_notifikasi')
                                                 ->where('user_id', session()->get('id'))
                                                 ->where('is_read', 0)
                                                 ->orderBy('created_at', 'DESC')
                                                 ->get()->getResultArray();
---
SELECT *
FROM `tb_notifikasi`
WHERE `user_id` = '1'
AND `is_read` = 0
ORDER BY `created_at` DESC